package Java_Syntax_Pro.L4;
/*
Я никогда не буду работать за копейки
*/

public class lvl4_1 {
    public static void main(String[] args) {
        String quote = "Я никогда не буду работать за копейки. Амиго";
        //напишите тут ваш код
        int n = 0;
        while (n<100){
            System.out.println(quote);
            n++;
        }
    }
}
/*
Используя цикл while вывести на экран сто раз цитату (переменная quote):
«Я никогда не буду работать за копейки. Амиго»

Каждое значение вывести с новой строки.

Требования:
•	Программа должна выводить текст на экран.
•	Программа должна выводить на экран 100 раз содержимое переменной quote.
•	В программе необходимо использовать цикл while.

* */