package Java_Syntax_Pro.L10;
/*
Литералы с плавающей точкой
*/
public class lvl10_2 {
    public double a = 0.;
    public double b = .0;
    public double c = 100D;
    public double d = 100.0;
    public double e = 1.11E5;
    public float f = 200F;
    public float g = 0.F;
}
/*
*
В классе Solution объявлены и проинициализированы семь публичных полей.
Они инициализируются разными значениями — литералами с плавающей точкой.
* Но программа не компилируется, и нужно это исправить.
* Для этого измени типы полей, чтобы они соответствовали значениям. Имена и значения полей не изменяй.

Требования:
•	Изменить тип поля a, чтобы программа компилировалась.
•	Изменить тип поля b, чтобы программа компилировалась.
•	Изменить тип поля c, чтобы программа компилировалась.
•	Изменить тип поля d, чтобы программа компилировалась.
•	Изменить тип поля e, чтобы программа компилировалась.
•	Изменить тип поля f, чтобы программа компилировалась.
•	Изменить тип поля g, чтобы программа компилировалась.*/